In [1]:
import numpy as np
import pandas as pd

In [2]:
ser_a = pd.Series([100,200,300], index=['a','b','c'])
ser_a

a    100
b    200
c    300
dtype: int64

In [3]:
ser_b = pd.Series([100,200,300,400], index=['a','b','c','d'])
ser_b

a    100
b    200
c    300
d    400
dtype: int64

In [4]:
ser_a + ser_b

a    200.0
b    400.0
c    600.0
d      NaN
dtype: float64

In [5]:
df1 = pd.DataFrame(np.arange(4).reshape(2,2), index=['car','bike'], columns=['a','b'])
df1

      a  b
car   0  1
bike  2  3

In [6]:
df2 = pd.DataFrame(np.arange(9).reshape(3,3), index=['car','bike','cycle'], columns=['a','b','c'])
df2

       a  b  c
car    0  1  2
bike   3  4  5
cycle  6  7  8

In [7]:
df1 + df2

         a    b   c
bike   5.0  7.0 NaN
car    0.0  2.0 NaN
cycle  NaN  NaN NaN

In [8]:
df1 = df1.add(df2, fill_value=0)          # the values which are not present in df1, are assigned 0 value, and then added to df2
df1

         a    b    c
bike   5.0  7.0  5.0
car    0.0  2.0  2.0
cycle  6.0  7.0  8.0

In [9]:
ser_c = df2.loc['car']                 # make car index of df2 dataframe as a series and store in ser_c
ser_c

a    0
b    1
c    2
Name: car, dtype: int32

In [15]:
df2 - ser_c          # subtract ser_c from all rows of df2

       a  b  c
car    0  0  0
bike   3  3  3
cycle  6  6  6